# 1. Указываем базовый образ для сборки
FROM golang:1.22 AS build

# 2. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 3. Копируем все файлы проекта в контейнер
COPY docker .

# 4. Загружаем зависимости (модули Go)
RUN go mod download

# 5. Собираем бинарник приложения
RUN go build -o myapp ./cmd/service

# 6. Создаем минимальный финальный образ
FROM alpine:3.18

# 7. Устанавливаем директорию для приложения в финальном образе
WORKDIR /app

# 8. Копируем скомпилированный бинарник из предыдущего контейнера
COPY --from=build /app/myapp .

# 9. Устанавливаем команду запуска по умолчанию
CMD ["./myapp"]
